thanhtra3105/UAV_Air_Quality_Monitor/fc_stm32/Core/Src/main.c
// ===== DSP310 ======
float alt_offset = 0;

// ================= OUTPUT PID =================
float pid_p, pid_r, pid_y;
float pid_alt_vel_out = 0.0f;

float yaw_filt = 0;

/*========SAFE CONNECTED========*/
uint32_t timeout_connected = 0;
uint32_t time_throttle = 0;

uint8_t pid_flag = 0;
int distance = 0;
float vx = 0;
float vy = 0;
float current_alt;
uint8_t alt_hold = 0;
uint8_t alt_init = 0;

extern char gps_buffer[100];
extern volatile uint8_t gps_ready;
extern uint8_t rx_byte;

float time_dt = 0;

char raw_gps_buffer[120];
uint16_t raw_index = 0;
volatile uint8_t line_ready = 0;

//==== EST POSITION=====
#define FLOW_ALPHA     0.2f
#define KP_FLOW        0.25f
#define KI_FLOW        0.02f
#define KP_POS         0.10f

float ax_earth = 0.0f;
float ay_earth = 0.0f;

float ax_bias = 0.0f;
float ay_bias = 0.0f;

// Vận tốc ước lượng (Earth Frame)
float est_vx = 0.0f;
float est_vy = 0.0f;

// Vị trí ước lượng (Earth Frame) - m
float est_x = 0.0f;
float est_y = 0.0f;

// Thêm vào vùng khai báo biến toàn cục
PIDController_t PID_Pos_X;
PIDController_t PID_Pos_Y;
PIDController_t PID_Vel_X;
PIDController_t PID_Vel_Y;

// Điểm neo (Target)
#define MAX_TARGET_VEL_XY 1.0f  // m/s, tùy kích thước/độ nhạy drone của bạn
float target_x = 0.0f;
float target_y = 0.0f;

float target_vx = 0.0f;
float target_vy = 0.0f;

uint8_t pos_hold_active = 0; // Cờ trạng thái

uint8_t status = 0;
float ist_heading = 0.0f;

// === BIẾN CHO GPS POSITION HOLD ===
double home_lat = 0.0f;
double home_lon = 0.0f;
float gps_x = 0.0f, gps_y = 0.0f;
float last_gps_x = 0.0f, last_gps_y = 0.0f;
float gps_vx = 0.0f, gps_vy = 0.0f;
uint8_t gps_hold_active = 0;
uint8_t gps_home_set = 0;

static float acc_z_filt = 0.0f;

// Buffer chứa dữ liệu thô từ DMA
uint8_t rx_mission_buffer[MISSION_BUFFER_SIZE];

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart) {
	if (huart->Instance == UART7) {
		UART_CMD_Process(&huart7);
//		GPS_UART_RxCallback(&huart1);
	}

	if (huart->Instance == USART2) {
		MTF01_Process(&huart2);
	}

//	GPS_UART_RxCallback(&huart1);
//	if (huart->Instance == USART1) {
//		// CHÌA KHÓA Ở ĐÂY: Chỉ cho phép lưu data khi mảng đang rảnh (line_ready == 0)
//		if (line_ready == 0) {
//			raw_gps_buffer[raw_index++] = rx_byte;
//
//			// Nếu gặp ký tự xuống dòng hoặc mảng sắp tràn
//			if (rx_byte == '\n' || raw_index >= 119) {
//				raw_gps_buffer[raw_index] = '\0'; // Chốt chuỗi
//				line_ready = 1;             // Khóa mảng lại, báo cho main xử lý
//			}
//		}
//
//		// Vẫn phải mồi lại ngắt (dù có lưu vào mảng hay không) để tránh ORE
//		HAL_UART_Receive_IT(&huart1, &rx_byte, 1);
//	}
}
int counttt = 0;
// Hàm Callback mặc định của HAL cho sự kiện Receive To IDLE
void HAL_UARTEx_RxEventCallback(UART_HandleTypeDef *huart, uint16_t Size) {
	// Đẩy sự kiện sang cho hàm xử lý của ta bên file gps.c
	GPS_UART_RxEventCallback(huart, Size);
	if (huart->Instance == UART7) // Đã chuyển sang UART7
	{
		counttt++;
		// Đẩy phần dữ liệu vừa nhận được vào module xử lý Mission
		Mission_ParseChunk(rx_mission_buffer, Size);

		// Khởi động lại DMA để tiếp tục đón mẻ dữ liệu mới từ ESP32
		HAL_UARTEx_ReceiveToIdle_DMA(&huart7, rx_mission_buffer,
		MISSION_BUFFER_SIZE);
	}
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim) {
	if (htim->Instance == TIM6) {
		pid_flag = 1;
	}

}

long map(long x, long in_min, long in_max, long out_min, long out_max) {
	return (x - in_min) * (out_max - out_min) / (in_max - in_min) + out_min;
}

float constrain(float data, float min, float max) {
	if (data <= min)
		return min;
	if (data >= max)
		return max;
	return data;
}
void writeMotor(uint8_t chanel, int16_t us) {
	__HAL_TIM_SET_COMPARE(&htim3, chanel, us);
}

void Failsafe_Task(void) {
	if (HAL_GetTick() - timeout_connected > 1000) {
		alt_hold = false;

		if (HAL_GetTick() - time_throttle > 400) {
			if (throttle > 1200) {
				throttle -= 5;
				time_throttle = HAL_GetTick();
			} else {
				if (mtf_data.distance < 200)	// <20cm
					throttle = 1000;
			}
		}
	}
}

float target_pitch_body = 0.0f, target_roll_body = 0.0f;
void RxController() {
	if (NRF24_Available()) {
		uint8_t len = NRF24_GetDynamicPayloadSize();

		if (len == sizeof(ControlData)) {
			NRF24_Read((uint8_t*) &rxData, len);
			throttle = rxData.chinhtocdoquat;
			target_roll = (float) map(rxData.trucX, 0, 100,
					(long) MAX_TARGET_ROLL_PITCH,
					(long) -MAX_TARGET_ROLL_PITCH);
			target_pitch = (float) map(rxData.trucY, 0, 100,
					(long) MAX_TARGET_ROLL_PITCH,
					(long) -MAX_TARGET_ROLL_PITCH);
			alt_hold = rxData.nut1;
			timeout_connected = HAL_GetTick();
		}
		txData.lat = (int32_t) (gps.latitude * 1e7);
		txData.lon = (int32_t) (gps.longitude * 1e7);
		txData.x = est_x;
		txData.y = est_y;
		txData.alt = current_alt;
		NRF24_WriteAckPayload(0, &txData, sizeof(TelemetryData));

	} else {
		Failsafe_Task();
	}
}

void readIMU() {
	ICM20602_Read(&imu);
	gx = (imu.gyro.x - gx_offset);
	gy = (imu.gyro.y - gy_offset);
	gz = -(imu.gyro.z - gz_offset);

	ax = imu.accel.x - ax_offset;
	ay = imu.accel.y - ay_offset;
	az = imu.accel.z - (az_offset - 1);
}

// Các thông số nhiễu đo lường (Measurement Noise) - Bạn cần tinh chỉnh thực tế
#define OPTICAL_FLOW_R 0.5f // Phương sai nhiễu đo vận tốc của Optical flow

void Estimate_Position_Kalman(float dt) {
	/*=============================
	 1. Rotation Body -> Earth
	 =============================*/
	float cy = cosf(yaw * DEG_TO_RAD);
	float sy = sinf(yaw * DEG_TO_RAD);
	float cp = cosf(pitch * DEG_TO_RAD);
	float sp = sinf(pitch * DEG_TO_RAD);
	float cr = cosf(roll * DEG_TO_RAD);
	float sr = sinf(roll * DEG_TO_RAD);

	ax_earth = cy * cp * ax + (cy * sp * sr - sy * cr) * ay
			+ (cy * sp * cr + sy * sr) * az;

	ay_earth = sy * cp * ax + (sy * sp * sr + cy * cr) * ay
			+ (sy * sp * cr - cy * sr) * az;

	ax_earth *= 9.81f;
	ay_earth *= 9.81f;

	/*=============================
	 2. Optical Flow -> Earth (Giữ nguyên của bạn)
	 =============================*/
	float body_vx = -mtf_data.vy; // Tiến/Lùi
	float body_vy = mtf_data.vx;  // Trái/Phải

	float flow_vx = body_vx * cy - body_vy * sy;
	float flow_vy = body_vx * sy + body_vy * cy;

	// (Tuỳ chọn: bạn có thể vẫn giữ Low Pass Filter cho flow_vx, flow_vy nếu nhiễu quá mạnh,
	// nhưng bản chất KF đã lo việc lọc nhiễu, bạn có thể truyền thẳng flow vào Update)

