thanhtra3105/UAV_Air_Quality_Monitor/fc_stm32/Core/Src/main.c
	/*=============================
	 3. Kalman PREDICT (Dựa vào IMU)
	 =============================*/
	// LƯU Ý: Nếu dùng KF 2-state, bạn nên trừ bias thủ công trước khi đưa vào Predict
	// nếu bạn vẫn muốn giữ cơ chế trừ bias cũ.
	float ax_input = ax_earth - ax_bias;
	float ay_input = ay_earth - ay_bias;

	KalmanAxis_Predict(&kf_x, ax_input, dt);
	KalmanAxis_Predict(&kf_y, ay_input, dt);

	/*=============================
	 4. Kalman UPDATE (Dựa vào Optical Flow)
	 =============================*/
	if (mtf_data.flow_quality > 50 && mtf_data.distance >= 100) {
		// Cập nhật KF bằng vận tốc đo được từ Flow
		KalmanAxis_UpdateVel(&kf_x, flow_vx, OPTICAL_FLOW_R);
		KalmanAxis_UpdateVel(&kf_y, flow_vy, OPTICAL_FLOW_R);

		// Cập nhật Bias theo kiểu cũ (Do KF 2 trạng thái không tự ước lượng bias)
		float err_vx = flow_vx - kf_x.vel;
		float err_vy = flow_vy - kf_y.vel;
		ax_bias += KI_FLOW * err_vx * dt;
		ay_bias += KI_FLOW * err_vy * dt;
	}

	/*=============================
	 5. Cập nhật biến State cho hàm Position Hold
	 =============================*/
	est_x = kf_x.pos;
	est_vx = kf_x.vel;

	est_y = kf_y.pos;
	est_vy = kf_y.vel;
}
static float computeHeading(float bx, float by, float bz, float roll_deg,
		float pitch_deg) {
	float roll_rad = roll_deg * DEG_TO_RAD;
	float pitch_rad = pitch_deg * DEG_TO_RAD;
	float cr = cosf(roll_rad), sr = sinf(roll_rad);
	float cp = cosf(pitch_rad), sp = sinf(pitch_rad);

	float mx = bx * cp + by * sr * sp + bz * cr * sp;
	float my = by * cr - bz * sr;

	float heading = atan2f(my, mx) * RAD_TO_DEG; /* atan2f trả về sẵn trong [-180,180] */
	if (heading > 180.0f)
		heading -= 360.0f;
	if (heading < -180.0f)
		heading += 360.0f;
	return heading;
}

float readHeading(float roll_deg, float pitch_deg) {
#ifdef USE_QMC5883
	QMC5883_Read(&hi2c2, &mag);
	return computeHeading(mag.x, mag.y, mag.z, roll_deg, pitch_deg);

#else   /* IST8310 */
	static float last_heading = 0.0f;

	if (IST8310_Read(&hi2c2, &ist8310) == IST8310_OK) {
		last_heading = computeHeading(ist8310.raw_y, -ist8310.raw_x,
				-ist8310.raw_z, roll_deg, pitch_deg);
	}
	return last_heading;

#endif
}

float readAltitude(float pressure_hPa)		// pressure unit hPa
{
	float h = 44330 * (1 - pow((pressure_hPa / 1013.25), (1 / 5.255)));
	return h;	// met
}

void calculateAngle(float dt) {		// 500Hz

	float roll_acc = atan2(ay, sqrt(ax * ax + az * az)) * 57.2958;
	float pitch_acc = atan2(-ax, sqrt(ay * ay + az * az)) * 57.2958;
//  ================= KALMAN FILTER =================
	Kalman1D_Compute(roll, KalmanUncertaintyAngleRoll, gx, roll_acc, dt);
	roll = Kalman1DOutput[0];
	KalmanUncertaintyAngleRoll = Kalman1DOutput[1];

	Kalman1D_Compute(pitch, KalmanUncertaintyAnglePitch, gy, pitch_acc, dt);
	pitch = Kalman1DOutput[0];
	KalmanUncertaintyAnglePitch = Kalman1DOutput[1];

	//---------------- Yaw ----------------- //
	// 1. Predict bằng gyro
	yaw += gz * dt;
	if (yaw > 180.0f)
		yaw -= 360.0f;
	if (yaw < -180.0f)
		yaw += 360.0f;
	// 2. Heading từ la bàn
	float heading = readHeading(roll, pitch);
	static float heading_lpf = 0.0f;

	heading_lpf += 0.1f * (heading - heading_lpf);
	// 3. Sai số nhỏ nhất
	float err = heading_lpf - yaw;
	if (err > 180.0f)
		err -= 360.0f;

	if (err < -180.0f)
		err += 360.0f;
	// 4. Complementary Filter
	const float alpha = 0.01f;      // 0.01~0.05
	yaw += alpha * err;
	if (yaw > 180.0f)
		yaw -= 360.0f;
	if (yaw < -180.0f)
		yaw += 360.0f;

	/* ============ALTITUDE HOLD - INNER (Velocity, 500Hz) ===========*/
	float acc_z_inertial = -sin(pitch * DEG_TO_RAD) * ax
			+ cos(pitch * DEG_TO_RAD) * sin(roll * DEG_TO_RAD) * ay
			+ cos(pitch * DEG_TO_RAD) * cos(roll * DEG_TO_RAD) * az;
	acc_z_inertial = (acc_z_inertial - 1) * 981.0f;

//	static float acc_z_filt = 0.0f;
	static bool acc_z_filt_init = false;
	const float LPF_ALPHA = 0.2f;
	if (!acc_z_filt_init) {
		acc_z_filt = acc_z_inertial;
		acc_z_filt_init = true;
	} else {
		acc_z_filt = LPF_ALPHA * acc_z_inertial
				+ (1.0f - LPF_ALPHA) * acc_z_filt;
	}

//	Kalman2D_Predict(&kf, acc_z_filt, dt); // <-- dùng dt_rate (2ms), không phải dt_angle
//	static float tof_cm = 0;
//	if (mtf01_updated) {
//		tof_cm = mtf_data.distance * 0.1f;
//		tof_cm = tof_cm * cosf(roll * DEG_TO_RAD) * cosf(pitch * DEG_TO_RAD);
//		current_alt = tof_cm;
//		Kalman2D_Update(&kf, current_alt, 1.0f);
//		mtf01_updated = 0; // update done
//	}

	Kalman4D_Predict(&kf_4d, acc_z_filt, dt);
	static float dsp310_alt_cm = 0;

	if (DSP310_Read(&dsp_sensor)) {
		dsp310_alt_cm = (dsp_sensor.altitude - alt_offset) * 100;
		current_alt = dsp310_alt_cm;
		Kalman4D_Update(&kf_4d, current_alt, 5.0f);
	}
}

void Estimate_Position(float dt) {
	/*=============================
	 Rotation Body -> Earth
	 =============================*/
	float cy = cosf(yaw * DEG_TO_RAD);
	float sy = sinf(yaw * DEG_TO_RAD);
//	float cy = 1.0f;
//	float sy = 0.0f;
	float cp = cosf(pitch * DEG_TO_RAD);
	float sp = sinf(pitch * DEG_TO_RAD);
	float cr = cosf(roll * DEG_TO_RAD);
	float sr = sinf(roll * DEG_TO_RAD);

	ax_earth = cy * cp * ax + (cy * sp * sr - sy * cr) * ay
			+ (cy * sp * cr + sy * sr) * az;

	ay_earth = sy * cp * ax + (sy * sp * sr + cy * cr) * ay
			+ (sy * sp * cr - cy * sr) * az;

	ax_earth *= 9.81f;
	ay_earth *= 9.81f;

	/*=============================
	 Optical Flow -> Earth
	 =============================*/
	float body_vx = -mtf_data.vy; // Tiến/Lùi
	float body_vy = mtf_data.vx;  // Trái/Phải

	float flow_vx = body_vx * cy - body_vy * sy;
	float flow_vy = body_vx * sy + body_vy * cy;

	/*=============================
	 Low Pass Filter cho Flow
	 =============================*/
	static float flow_vx_lp = 0.0f;
	static float flow_vy_lp = 0.0f;

	flow_vx_lp += FLOW_ALPHA * (flow_vx - flow_vx_lp);
	flow_vy_lp += FLOW_ALPHA * (flow_vy - flow_vy_lp);

	/*=============================
	 Prediction (IMU)
	 =============================*/
	float ax_correct = ax_earth - ax_bias;
	float ay_correct = ay_earth - ay_bias;

	est_vx += ax_correct * dt;
	est_vy += ay_correct * dt;

	/*=============================
	 Correction (Optical Flow)
	 =============================*/
	// Cần > 100mm (10cm) để tránh Ground Effect
	if (mtf_data.flow_quality > 50 && mtf_data.distance >= 100) {
		float err_vx = flow_vx_lp - est_vx;
		float err_vy = flow_vy_lp - est_vy;

		ax_bias += KI_FLOW * err_vx * dt;
		ay_bias += KI_FLOW * err_vy * dt;

		est_vx += KP_FLOW * err_vx;
		est_vy += KP_FLOW * err_vy;
	}

