thanhtra3105/UAV_Air_Quality_Monitor/fc_stm32/Core/Src/main.c
	/*=============================
	 Integrate Position
	 =============================*/
	est_x += est_vx * dt;
	est_y += est_vy * dt;
}

void positionHold(float dt) {
	uint8_t pos_hold_sw = rxData.nut2;

	if (pos_hold_sw && alt_hold) {
		if (!pos_hold_active) {
			target_x = est_x;
			target_y = est_y;
			PID_Reset(&PID_Pos_X);
			PID_Reset(&PID_Pos_Y);
			PID_Reset(&PID_Vel_X);
			PID_Reset(&PID_Vel_Y);
			pos_hold_active = 1;
		}
		// ====== POSITION LOOP=====
		float err_x = target_x - est_x;
		float err_y = target_y - est_y;
		target_vx = PID_Calculate(&PID_Pos_X, err_x, dt);
		target_vy = PID_Calculate(&PID_Pos_Y, err_y, dt);

		target_vx = constrain(target_vx, -MAX_TARGET_VEL_XY, MAX_TARGET_VEL_XY);
		target_vy = constrain(target_vy, -MAX_TARGET_VEL_XY, MAX_TARGET_VEL_XY);

		// ==== VELOCITY X,Y LOOP=====
		float err_vx = target_vx - est_vx;
		float err_vy = target_vy - est_vy;

		// 1. Góc nghiêng (hoặc Lực đẩy) cần thiết trên hệ tọa độ Trái Đất
		float out_angle_earth_x = PID_Calculate(&PID_Vel_X, err_vx, dt);
		float out_angle_earth_y = PID_Calculate(&PID_Vel_Y, err_vy, dt);

		// 2. ĐẢO DẤU TẠI ĐÂY NẾU TRỤC BỊ NGƯỢC CHIỀU
		// Chuyển dấu trừ từ target_pitch lên đây!
		out_angle_earth_x = -out_angle_earth_x;

		// (Ghi chú: Nếu Roll của bạn cũng bị ngược thì thêm dấu trừ vào dòng dưới)
		// out_angle_earth_y = -out_angle_earth_y;

		// 3. VÒNG ROTATION (Xoay từ Earth -> Body)
		float cy = cosf(yaw * DEG_TO_RAD);
		float sy = sinf(yaw * DEG_TO_RAD);

		// Hàm xoay toán học nguyên bản, tuyệt đối không chèn thêm dấu ở đây
		target_pitch_body = out_angle_earth_x * cy + out_angle_earth_y * sy;
		target_roll_body = -out_angle_earth_x * sy + out_angle_earth_y * cy;

		// 4. Giới hạn góc nghiêng tối đa
		target_pitch_body = constrain(target_pitch_body, -15.0f, 15.0f);
		target_roll_body = constrain(target_roll_body, -15.0f, 15.0f);

		// 5. GÁN TRỰC TIẾP, KHÔNG CÒN DẤU TRỪ NÀO NỮA
		target_pitch = target_pitch_body;
		target_roll = target_roll_body;
	} else {
		// Tắt Pos Hold
		if (pos_hold_active) {
			pos_hold_active = 0;
			// Trả lại target_pitch và target_roll cho tay cầm (RC)
		}
	}
}

#define GPS_POS_R      2.5f
#define KI_GPS_BIAS    0.02f   // hệ số học bias — BẮT ĐẦU NHỎ, tune tăng dần
#define MAX_ACCEL_BIAS 1.0f    // m/s^2, chặn để tránh runaway khi GPS jump/nhiễu

float lat_err, lon_err;
float pos_N, pos_E;
void Estimate_Position_GPS_Kalman(float dt) {
	/*=============================
	 1. Xoay gia tốc từ Body -> Earth Frame
	 =============================*/
	/* Covert FLU to FRD*/
	float ax_frd = ax;
	float ay_frd = -ay;
	float az_frd = -az;

	float cy = cosf(yaw * DEG_TO_RAD);
	float sy = sinf(yaw * DEG_TO_RAD);

	float cp = cosf(pitch * DEG_TO_RAD);
	float sp = sinf(pitch * DEG_TO_RAD);

	float cr = cosf(roll * DEG_TO_RAD);
	float sr = sinf(roll * DEG_TO_RAD);
	/*========================================
	 * FRD -> NED
	 *========================================*/

	ax_earth = cy * cp * ax_frd + (-cy * sp * sr - sy * cr) * ay_frd
			+ (-cy * sp * cr + sy * sr) * az_frd;

	ay_earth = sy * cp * ax_frd + (-sy * sp * sr + cy * cr) * ay_frd
			+ (-sy * sp * cr - cy * sr) * az_frd;

	/* g -> m/s² */
	ax_earth *= 9.81f;
	ay_earth *= 9.81f;

	/*=============================
	 2. Kalman PREDICT (500Hz - IMU)
	 =============================*/
	KalmanGPS_Predict(&kf_North, ax_earth, dt);
	KalmanGPS_Predict(&kf_East, ay_earth, dt);

	/*=============================
	 3. Kalman UPDATE (Chạy ~10Hz bằng GPS)
	 =============================*/
	if (gps.fixType >= 3 && gps.ready == 1) {
		if (!gps_home_set) {
			home_lat = gps.latitude;
			home_lon = gps.longitude;
			gps_home_set = 1;

			// Reset trạng thái
			kf_North.pos = 0.0f;
			kf_North.vel = 0.0f;
			kf_North.bias = 0.0f;
			kf_East.pos = 0.0f;
			kf_East.vel = 0.0f;
			kf_East.bias = 0.0f;

		} else {
			lat_err = (float) gps.latitude - home_lat;
			lon_err = (float) gps.longitude - home_lon;

			pos_N = lat_err * 111320.0f;
			pos_E = lon_err * 111320.0f * cosf(home_lat * DEG_TO_RAD);

			float vel_N = (float) gps.velN / 1000.0f;
			float vel_E = (float) gps.velE / 1000.0f;

			// Bình phương biến số sai số GPS để làm nhiễu (Ví dụ pAcc báo sai số 1.5m -> r = 1.5*1.5)
			float r_pos_noise = (float) (gps.hAcc / 1000.0f)
					* (gps.hAcc / 1000.0f);
			float r_vel_noise = (float) (gps.sAcc / 1000.0f)
					* (gps.sAcc / 1000.0f);

			KalmanGPS_Update(&kf_North, pos_N, vel_N, r_pos_noise, r_vel_noise);
			KalmanGPS_Update(&kf_East, pos_E, vel_E, r_pos_noise, r_vel_noise);
		}
		gps.ready = 0;
	}

	/* 4. Gán State cho hàm PID Position Hold */
	est_x = kf_North.pos;
	est_vx = kf_North.vel;
	est_y = kf_East.pos;
	est_vy = kf_East.vel;
}

//float err_x, err_y;
uint16_t current_wp_index = 0;
uint8_t mission_running = 0;
#define WAYPOINT_RADIUS 2.0f // Bán kính 2 mét để xác nhận đã đến điểm

void GPS_PositionHold(float dt) {		// PID
	uint8_t gps_hold_sw = rxData.nut2;

	// Yêu cầu phải bật công tắc, có sóng GPS và đã chốt Home
	if (rxData.nut1 && gps_hold_sw && gps_home_set) {
		if (!pos_hold_active) {
			target_x = est_x; // Khóa vị trí hiện tại của Kalman
			target_y = est_y;

			current_wp_index = 0;

			// Kiểm tra xem có Mission nào trong RAM chưa
			if (Mission_IsReady() && Mission_GetCount() > 0) {
				mission_running = 1;
			} else {
				mission_running = 0;
			}

			PID_Reset(&PID_Pos_X);
			PID_Reset(&PID_Pos_Y);
			PID_Reset(&PID_Vel_X);
			PID_Reset(&PID_Vel_Y);
			pos_hold_active = 1;
		}

		if (mission_running) {
			Waypoint_t current_wp = Mission_GetWaypoint(current_wp_index);

			// Quy đổi tọa độ Waypoint sang hệ mét (North/East) giống hệt hàm Kalman
			float wp_lat_err = (float) current_wp.lat - home_lat;
			float wp_lon_err = (float) current_wp.lon - home_lon;

			float wp_target_x = wp_lat_err * 111320.0f;
			float wp_target_y = wp_lon_err * 111320.0f
					* cosf(home_lat * DEG_TO_RAD);

			// Cập nhật mục tiêu cho PID Position
			target_x = wp_target_x;
			target_y = wp_target_y;

			// Tính khoảng cách Euclid từ Drone đến Waypoint hiện tại
			float dx = target_x - est_x;
			float dy = target_y - est_y;
			float dist_to_wp = sqrtf(dx * dx + dy * dy);

			// Nếu Drone đã bay lọt vào bán kính Waypoint
			if (dist_to_wp < WAYPOINT_RADIUS) {
				// Kiểm tra xem còn Waypoint nào tiếp theo không
				if (current_wp_index < Mission_GetCount() - 1) {
					current_wp_index++; // Chuyển mục tiêu sang điểm tiếp theo
				}
				// (Nếu là điểm cuối cùng, nó sẽ không tăng index, drone tự động Hover tại điểm cuối)
			}
		}

		float err_x = target_x - est_x;
		float err_y = target_y - est_y;

		target_vx = PID_Calculate(&PID_Pos_X, err_x, dt);
		target_vy = PID_Calculate(&PID_Pos_Y, err_y, dt);
		/* CONSTRAIN velocity 2m/s*/
		target_vx = constrain(target_vx, -2.0f, 2.0f);
		target_vy = constrain(target_vy, -2.0f, 2.0f);

		// ==== VELOCITY X,Y LOOP=====
		float err_vx = target_vx - est_vx;
		float err_vy = target_vy - est_vy;

		// 1. Tính toán lực đẩy cần thiết trên hệ tọa độ Trái Đất (X=North, Y=East)
		float out_angle_earth_x = PID_Calculate(&PID_Vel_X, err_vx, dt);
		float out_angle_earth_y = PID_Calculate(&PID_Vel_Y, err_vy, dt);

		// 2. VÒNG ROTATION (Xoay từ Earth -> Body)
		float cy = cosf(yaw * DEG_TO_RAD);
		float sy = sinf(yaw * DEG_TO_RAD);

