thanhtra3105/UAV_Air_Quality_Monitor/fc_stm32/Core/Src/main.c
		// Phân tách lực Earth thành lực kéo trên hệ Body (Front và Right)
		// Tuyệt đối không tự ý thêm dấu trừ vào các công thức lượng giác này
		float force_body_x = out_angle_earth_x * cy + out_angle_earth_y * sy;
		float force_body_y = -out_angle_earth_x * sy + out_angle_earth_y * cy;

		// 3. Giới hạn góc nghiêng/lực tối đa
		force_body_x = constrain(force_body_x, -10.0f, 10.0f);
		force_body_y = constrain(force_body_y, -10.0f, 10.0f);

		// 4. MAPPING TRỰC TIẾP LÊN TRỤC CỦA DRONE (Gắn dấu)
		// Theo hệ thống của bạn: Tiến = Pitch âm, Phải = Roll dương
		target_pitch = force_body_x;
		target_roll = force_body_y;
		txData.target_x = target_roll;
		txData.target_y = target_pitch;
	} else {
		if (pos_hold_active) {
			pos_hold_active = 0;
			mission_running = 0;
//			gps_home_set = 0;
			// Bỏ PosHold, phi công giành lại quyền điều khiển stick
			// Để an toàn, có thể reset gps_home_set = 0 khi tắt
		}
	}
}

void calculatePIDAngle(float dt_angle) {
	/* ============ALTITUDE HOLD - CASCADE===========*/
	if (alt_hold && !alt_init) {
		alt_init = true;
//		target_alt = kf.altitude;      // chốt độ cao hiện tại làm setpoint
		target_alt = kf_4d.altitude;
		PID_Reset(&PID_Alt_Pos);
		PID_Reset(&PID_Alt_Vel);
	}

	if (alt_hold) {
		float alt_err = target_alt - kf_4d.altitude;
		target_vz = PID_Calculate(&PID_Alt_Pos, alt_err, dt_angle);
		target_vz = constrain(target_vz, -MAX_TARGET_VZ, MAX_TARGET_VZ);
	} else {
		alt_init = false;
		target_vz = 0;
		PID_Reset(&PID_Alt_Pos);
	}

	//	========== OPTICAL FLOW MTF01 POS HOLD =============
//	positionHold(dt_angle);
	//	========== GPS POS HOLD =============
	GPS_PositionHold(dt_angle);

	//  ================= PID ANGLE =================
	float pitch_err = target_pitch - pitch;
	target_rate_pitch = PID_Calculate(&PID_Angle, pitch_err, dt_angle);

	float roll_err = target_roll - roll;
	target_rate_roll = PID_Calculate(&PID_Angle, roll_err, dt_angle);

	float yaw_err = target_yaw - yaw;
	if (yaw_err > 180)
		yaw_err -= 360;
	if (yaw_err < -180)
		yaw_err += 360;
	target_rate_yaw = PID_Calculate(&PID_Angle, yaw_err, dt_angle);

	/* ======= CONSTRAINT =========*/
	target_rate_pitch = constrain(target_rate_pitch, -200, 200);
	target_rate_roll = constrain(target_rate_roll, -200, 200);
	target_rate_yaw = constrain(target_rate_yaw, -200, 200);
}

void calcualatePIDRate(float dt_rate) {
//  ================= PID RATE =================
	float pitch_rate_err = target_rate_pitch - gy;
	pid_p = PID_Calculate(&PID_Rate_Pitch, pitch_rate_err, dt_rate);

	float roll_rate_err = target_rate_roll - gx;
	pid_r = PID_Calculate(&PID_Rate_Roll, roll_rate_err, dt_rate);

	float yaw_rate_err = target_rate_yaw - gz;
	pid_y = PID_Calculate(&PID_Rate_Yaw, yaw_rate_err, dt_rate);

	if (alt_hold) {
//		float vz_err = target_vz - kf.velocity;	// tof
		float vz_err = target_vz - kf_4d.velocity;
		pid_alt_vel_out = PID_Calculate(&PID_Alt_Vel, vz_err, dt_rate);
		pid_alt = pid_alt_vel_out;
	} else {
		pid_alt = 0;
		PID_Reset(&PID_Alt_Vel);
	}

	pid_r = constrain(pid_r, -300, 300);
	pid_p = constrain(pid_p, -300, 300);
	pid_y = constrain(pid_y, -300, 300);
	pid_alt = constrain(pid_alt, -MAX_ALT_OUTPUT, MAX_ALT_OUTPUT);

}

int sp1, sp2, sp3, sp4;
void mixer() {
	int m1 = (int) (float) throttle - pid_p - pid_r - pid_y + pid_alt;
	int m2 = (int) (float) throttle + pid_p - pid_r + pid_y + pid_alt;
	int m3 = (int) (float) throttle + pid_p + pid_r - pid_y + pid_alt;
	int m4 = (int) (float) throttle - pid_p + pid_r + pid_y + pid_alt;

//	sp1 = m1;
//	sp2 = m2;
//	sp3 = m3;
//	sp4 = m4;

//	int m1 = (int) (float) throttle - pid_r;
//	int m2 = (int) (float) throttle - pid_r;
//	int m3 = (int) (float) throttle + pid_r;
//	int m4 = (int) (float) throttle + pid_r;

	if (throttle > 1040) {
		writeMotor(M1, m1);
		writeMotor(M2, m2);
		writeMotor(M3, m3);
		writeMotor(M4, m4);
	} else {
		writeMotor(M1, 1000);
		writeMotor(M2, 1000);
		writeMotor(M3, 1000);
		writeMotor(M4, 1000);
	}
}

static uint8_t angle_div = 0;

void PID_Task(float dt_pid) {
	if (++angle_div >= 2) {
		angle_div = 0;
		calculatePIDAngle(dt_pid * 2);      // 250 Hz
//		distance = readTOF(&hi2c1);
	}
	calcualatePIDRate(dt_pid);          // 500 Hz
}

void calibIMU() {
//	for (int i = 0; i < 500; i++) {
//		ICM20602_Read(&imu);
//		ax_offset += imu.accel.x;
//		ay_offset += imu.accel.y;
//		az_offset += imu.accel.z;
//
//		gx_offset += imu.gyro.x;
//		gy_offset += imu.gyro.y;
//		gz_offset += imu.gyro.z;
//	}
//	ax_offset = (ax_offset / 500);
//	ay_offset = (ay_offset / 500);
//	az_offset = (az_offset / 500);
//	gx_offset = (gx_offset / 500);
//	gy_offset = (gy_offset / 500);
//	gz_offset = (gz_offset / 500);

	// truong test
//	ax_offset = -0.0430698246;
//	ay_offset = -0.0115541993;
//	az_offset = 0.981339872;
//	gx_offset = 0.435978264;
//	gy_offset = -0.2842682;
//	gz_offset = 0.185610518;

	ax_offset = -0.0131186526;
	ay_offset = -0.0222158208;
	az_offset = 0.982454121;
	gx_offset = 0.564877927;
	gy_offset = -0.334876835;
	gz_offset = 0.182927459;
}

float DSP_CalibrationAltitude(uint8_t sample) {
	float h = 0;
	for (int i = 0; i < sample; i++) {
		DSP310_Read(&dsp_sensor);
		h += dsp_sensor.altitude;
		HAL_Delay(100);
	}
	return (float) h / sample;
}
/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void) {

	/* USER CODE BEGIN 1 */

	/* USER CODE END 1 */

	/* MCU Configuration--------------------------------------------------------*/

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

	/* USER CODE BEGIN Init */

	/* USER CODE END Init */

	/* Configure the system clock */
	SystemClock_Config();

	/* USER CODE BEGIN SysInit */

	/* USER CODE END SysInit */

	/* Initialize all configured peripherals */
	MX_GPIO_Init();
	MX_GPDMA1_Init();
	MX_TIM3_Init();
	MX_I2C1_Init();
	MX_I2C2_Init();
	MX_SPI1_Init();
	MX_UART4_Init();
	MX_USART1_UART_Init();
	MX_USART2_UART_Init();
	MX_ICACHE_Init();
	MX_UART7_Init();
	MX_TIM6_Init();
	MX_SPI2_Init();
	/* USER CODE BEGIN 2 */
	HAL_TIM_PWM_Init(&htim3);
	HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1);
	HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_2);
	HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_3);
	HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_4);

	HAL_TIM_Base_Start_IT(&htim6);

//	HAL_UART_Init(&huart7);
//	Serial_Init(&huart1, 115200);
//	UART_Command_Init(&huart7);
//	MTF01_Init(&mtf01_handle, &huart2);
//	GPS_Init(&huart1);
	GPS_Init_DMA(&huart1);
	MTF01_Init(&huart2);

	HAL_I2C_Init(&hi2c1);
	HAL_I2C_Init(&hi2c2);
#ifdef USE_QMC5883
	QMC5883_Init(&hi2c2, &mag, 0x00, 0x01, 0x03, 0x01);
#else
	IST8310_Init(&hi2c2, &ist8310);
#endif
	HAL_SPI_Init(&hspi1);
	HAL_SPI_Init(&hspi2);
	ICM_CS_HIGH();
	NRF_CSN_HIGH();
	HAL_Delay(10);

	NRF24_Init();
	NRF24_OpenReadingPipe(0, address);
	NRF24_StartListening();

