thanhtra3105/UAV_Air_Quality_Monitor/fc_stm32/Core/Src/main.c
	HAL_Delay(500);
	DWT_Init();

	ICM20602_Init();
	mag.declination = 0;

	INA219_Init(&hi2c2);

	PID_Init(&PID_Angle, kp_angle, ki_angle, kd_angle, 0.2);
	PID_Init(&PID_Rate_Pitch, kp_p, ki_p, kd_p, 0.2);
	PID_SetIntegralLimits(&PID_Rate_Pitch, -60.0f, 60.0f);
	PID_Init(&PID_Rate_Roll, kp_r, ki_r, kd_r, 0.2);
	PID_SetIntegralLimits(&PID_Rate_Roll, -60.0f, 60.0f);
	PID_Init(&PID_Rate_Yaw, kp_y, ki_y, kd_y, 0.2);

	PID_Init(&PID_Alt, kp_alt, ki_alt, kd_alt, 0.2);
	PID_Init(&PID_Alt_Pos, kp_alt_pos, ki_alt_pos, kd_alt_pos, 0.2);
	PID_Init(&PID_Alt_Vel, kp_alt_vel, ki_alt_vel, kd_alt_vel, 0.2);
	PID_SetIntegralLimits(&PID_Alt_Vel, -40.0f, 40.0f);

	PID_Init(&PID_Pos_X, kp_xy_pos, ki_xy_pos, kd_xy_pos, 0.2);
	PID_Init(&PID_Pos_Y, kp_xy_pos, ki_xy_pos, kd_xy_pos, 0.2);

	PID_Init(&PID_Vel_X, kp_xy_vel, ki_xy_vel, kd_xy_vel, 0.2);
	PID_SetIntegralLimits(&PID_Vel_X, -6.0f, 6.0f); // 40% of 15deg
	PID_Init(&PID_Vel_Y, kp_xy_vel, ki_xy_vel, kd_xy_vel, 0.2);
	PID_SetIntegralLimits(&PID_Vel_Y, -6.0f, 6.0f);

	Kalman2D_Init(&kf, 16);
	KalmanAxis_Init(&kf_x);
	KalmanAxis_Init(&kf_y);
	KalmanAxis_Init(&kf_x_gps);
	KalmanAxis_Init(&kf_y_gps);

	KalmanPos_Init(&kf_pos_x, 0.004f, 0.05f, 1.5f);
	KalmanPos_Init(&kf_pos_y, 0.004f, 0.05f, 1.5f);

	KalmanGPS_Init(&kf_North, 0.0f, 0.0f, 0.1f, 0.001f);
	KalmanGPS_Init(&kf_East, 0.0f, 0.0f, 0.1f, 0.001f);

	Mission_Init();
	HAL_UARTEx_ReceiveToIdle_DMA(&huart7, rx_mission_buffer,
	MISSION_BUFFER_SIZE);

	if (!DSP310_Init(&dsp_sensor, &hi2c1)) {
		Serial_printf(&huart1, "DSP Init Failed!\r\n");
	} else
		Serial_printf(&huart1, "[OK] DSP Init Successful!\r\n");

	alt_offset = DSP_CalibrationAltitude(10);	// 10 sample

	DSP310_Read(&dsp_sensor);
	float h = dsp_sensor.altitude;
	Kalman4D_Init(&kf_4d, h - alt_offset);
	calibIMU();

	bool yaw_hold_init = false;

	Serial_printf(&huart1, "[WAITING] Waiting pull throttle to 0!\r\n");
	while (1) {
		if (NRF24_Available()) {
			uint8_t len = NRF24_GetDynamicPayloadSize();
			if (len == sizeof(ControlData)) {
				NRF24_Read((uint8_t*) &rxData, len);
				if (rxData.chinhtocdoquat == 1000)
					break;
			}
		}
	}
//	NRF24_WriteAckPayload(0, &txData, sizeof(TelemetryData));		// thong bao da ket noi thanh cong voi tx

	uint32_t ina219_timer = 0;
	uint32_t esp_timer = 0;
	Serial_printf(&huart1, "[OK] START\r\n");
	/* USER CODE END 2 */

	/* Infinite loop */
	/* USER CODE BEGIN WHILE */
	while (1) {
		/* USER CODE END WHILE */

		/* USER CODE BEGIN 3 */
		uint32_t start = DWT_GetMicros();
//		uint32_t time_get = HAL_GetTick();
		dt = 0.002f;
		RxController();
		if (!yaw_hold_init && throttle > 1030) {
			target_yaw = yaw;
			// home_position = gpsRead();
			yaw_hold_init = true;
		}
		if (throttle < 1030) {
			yaw_hold_init = false;
			target_yaw = yaw;
		}
		if (throttle < 1300) {
			PID_Reset(&PID_Rate_Yaw);
			PID_Reset(&PID_Rate_Pitch);
			PID_Reset(&PID_Rate_Roll);
			PID_Reset(&PID_Angle);
		}
//		if (pid_flag) {		// timer interrupt
//			PID_task();
//			pid_flag = 0;
//		}
		mtf01_updated = MTF01_Update(&mtf_data);
		GPS_Process(&gps);
//		if (Mission_IsReady()) {
////			char tx_buf[30];
////			sprintf(tx_buf,"%d\r\n", Mission_GetCount() );
////			HAL_UART_Transmit(&huart7, tx_buf, strlen(tx_buf), 20);
//		}
		readIMU();
		calculateAngle(dt);
		Estimate_Position_GPS_Kalman(dt);
		PID_Task(dt);
		mixer();
		if (DWT_GetMicros() - ina219_timer > 500000) {


			float voltage = INA219_Read(&hi2c2);
//			Serial_printf(&huart1, "%f\r\n", voltage);
			if (voltage >= 0.0f) {
				txData.battery = voltage;
			}
			ina219_timer = DWT_GetMicros();
		}
//		if (DWT_GetMicros() - esp_timer > 300000) {
//			char gps_tx[100]; // Tăng kích thước mảng lên để chứa đủ 8 số
//			// Format: lat, lon, est_x, est_y, pitch, roll, home_lat, home_lon
//			sprintf(gps_tx, "%f,%f,%f,%f,%f,%f,%f,%f\n", gps.latitude,
//					gps.longitude, est_x, est_y, target_pitch, target_roll,
//					home_lat, home_lon);
//
//			HAL_UART_Transmit(&huart7, (uint8_t*) gps_tx, strlen(gps_tx), 100);
//			esp_timer = DWT_GetMicros();
//		}
		if (gps.fixType == 3 && gps.numSV > 20 && mission_running)	// 3d fix and min 20 satelites
			HAL_GPIO_WritePin(GPIOB, GPIO_PIN_2, 1);
		else
			HAL_GPIO_WritePin(GPIOB, GPIO_PIN_2, 0);
		while ((DWT_GetMicros() - start) < 2000)
			;
//		time_dt = DWT_GetMicros() - start;
//		Serial_printf(&huart1, "dt=%.4f\r\n", time_dt);
	}
	/* USER CODE END 3 */
}

/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void) {
	RCC_OscInitTypeDef RCC_OscInitStruct = { 0 };
	RCC_ClkInitTypeDef RCC_ClkInitStruct = { 0 };

	/** Configure the main internal regulator output voltage
	 */
	__HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE0);

	while (!__HAL_PWR_GET_FLAG(PWR_FLAG_VOSRDY)) {
	}

	/** Initializes the RCC Oscillators according to the specified parameters
	 * in the RCC_OscInitTypeDef structure.
	 */
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI
			| RCC_OSCILLATORTYPE_CSI;
	RCC_OscInitStruct.HSIState = RCC_HSI_ON;
	RCC_OscInitStruct.HSIDiv = RCC_HSI_DIV2;
	RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
	RCC_OscInitStruct.CSIState = RCC_CSI_ON;
	RCC_OscInitStruct.CSICalibrationValue = RCC_CSICALIBRATION_DEFAULT;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
	RCC_OscInitStruct.PLL.PLLSource = RCC_PLL1_SOURCE_CSI;
	RCC_OscInitStruct.PLL.PLLM = 1;
	RCC_OscInitStruct.PLL.PLLN = 125;
	RCC_OscInitStruct.PLL.PLLP = 2;
	RCC_OscInitStruct.PLL.PLLQ = 4;
	RCC_OscInitStruct.PLL.PLLR = 2;
	RCC_OscInitStruct.PLL.PLLRGE = RCC_PLL1_VCIRANGE_2;
	RCC_OscInitStruct.PLL.PLLVCOSEL = RCC_PLL1_VCORANGE_WIDE;
	RCC_OscInitStruct.PLL.PLLFRACN = 0;
	if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
		Error_Handler();
	}

	/** Initializes the CPU, AHB and APB buses clocks
	 */
	RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
			| RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2 | RCC_CLOCKTYPE_PCLK3;
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
	RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
	RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
	RCC_ClkInitStruct.APB3CLKDivider = RCC_HCLK_DIV1;

	if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK) {
		Error_Handler();
	}

